# MemberForces Class (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
MemberForces Class
Members See Also
---
An object that represents a member forces on analytical model element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class MemberForces : IDisposable
```

Visual Basic
---
```text
Public Class MemberForces _
	Implements IDisposable
```

Visual C++
---
```text
public ref class MemberForces : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..MemberForces
# See Also
MemberForces Members
Autodesk.Revit.DB.Structure Namespace